# VisGraphicsAnalyticalModel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..VisGraphicsAnalyticalModel Property
ParameterTypeId Class See Also
---
"V/G Overrides Analytical Model"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId VisGraphicsAnalyticalModel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property VisGraphicsAnalyticalModel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ VisGraphicsAnalyticalModel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace